<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="I990MF1VX6K8ITZ2BQU8" Author="Полякова Виктория" Level="0" ADate="ESYEHKH2">
<Title>Операция последовательного вычисления</Title>
<P><Term Type="Out">Операция последовательного вычисления</Term> обозначается запятой (,) и используется для вычисления двух и более выражений там, где по синтаксису допустимо только одно выражение. Эта операция вычисляет два операнда слева направо. При выполнении операции последовательного вычисления, преобразование типов не производится. Операнды могут быть любых типов. Результат операции имеет значения и тип второго операнда. Отметим, что запятая может использоваться также как символ разделитель, поэтому необходимо по контексту различать, запятую, используемую в качестве разделителя или знака операции.S</P>
</Modul>
