<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="XKYRVNRTETMVPHSW16ZX" Author="Волосатова Т.М., Родионов С.В." Level="0" ADate="F1RZ6KOK">
<Title>Сортировка структур данных</Title>
<P>В различных методах сортировки рассматривали пока только массивы символов. Очевидно, что приведенные выше функции можно переделать для сортировки массивов любого из встроенных типов данных, просто поменяв типы параметров и переменных. Тем не менее, обычно возникает необходимость сортировать составные типы данных, например строки, или агрегированные данные, например структуры. Большинство задач сортировки имеют дело с ключом и информацией, связанной с этим ключом. Чтобы адаптировать алгоритмы для обработки подобных данных, необходимо модифицировать код сравнения, код обмена или оба фрагмента. Сам алгоритм при этом не меняется.</P>
<P>Поскольку <Term Type="In">быстрая сортировка</Term> в настоящее время является одним из лучших методов сортировки общего назначения, она используется в последующих примерах. Тем не менее, тот же принцип относится и ко всем остальным методам, описанным ранее.</P>
<P /></Modul>
