<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="985AVV4LZ0A4YDXMS5SR" Level="0" ADate="ET1RV757" Author="Волосатова">
<Title>Математические модели сигналов</Title>
<P>(Основы математического описания сигналов)</P>
<P>При математическом описании сигнал рассматривается как точка в некотором пространстве сигналов, которое представляет линейное метрическое пространство. В этой связи описать представление сигнала и его основных характеристик можно, используя свойства метрического линейного пространства.</P>
<P>Амплитуда сигнала-U- комплексная</P>
<P><Formula>U=U<Sub>1<Scalar>+</Scalar></Sub><Scalar>&#x3B9;U</Scalar><Sub>2</Sub></Formula>или <Formula>U=U&#x2080;e<Sup>&#x3AF;&#x3C6;</Sup></Formula> ,</P>
<P>U<Sub>0</Sub>- собственно амплитуда</P>
<P>&#x3C6;- фаза сигнала</P>
</Modul>
