<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="LFXKOG1IAH0LOLQ081NV" Level="1" ADate="ESZZTFYQ" Author="Волосатова">
<Title>Элементы теории сигналов</Title>
<P>Основная цель-создание представления об основных приемах и методах, аппаратных и программных средствах цифровой обработки сигналов.</P>
<P>Под <Term Type="Out">сигналом</Term> понимается физический процесс, отображающий сообщение и служащий для его передачи по каналу связи. Или сигнал- это форма, в которой воплощена передаваемая, хранимая или перерабатываемая информация.</P>
<P>В общем случае сигналы рассматриваются как функции, заданные в физических координатах, т<Formula>.е. U(x,y,z)</Formula></P>
<P><Font>Классификация сигналов</Font></P>
<P>При описании сигналов в первую очередь выделяются две наиболее общие характеристики:</P>

<List>
<P>множество значений, которые могут принимать сами сигналы;</P>
<P>множество значений, которые могут принимать формулы.</P>
</List>
<P>Исходя из этого можно представить следующую классификацию сигналов:</P>
<P>(Для классификации могут быть использованы разные критерии, поэтому можно предположить и разные классы сигналов).</P>

<List>
<P>Пространственный и временной</P>
</List>
<P><Term Type="Out">Пространственный сигнал</Term> - зависит только от пространственных координат. Наиболее часто- изображение- двумерный сигнал.</P>
<P><Term Type="Out">Временной сигнал</Term> - зависит только от времени. Электрический сигнал в ЭВМ</P>

<List>
<P>Финитный и инфинитный</P>
</List>
<P><Term Type="Out">Финитный сигнал</Term>- множество значений координат ограничено</P>
<P><Term Type="Out">Инфинитный сигнал</Term> - множество значений координат неограниченно</P>

<List>
<P>Аналоговый(непрерывный, дискретный, квантованный, цифровой)</P>
</List>
<P><Term Type="Out">Аналоговый сигнал</Term>- сигнал и его аргументы принимают непрерывные значения на числовых осях координат и значений.</P>
<P><Term Type="Out">Дискретный сигнал</Term> - аргументы сигнала принимают лишь счетное множество значений</P>
<P><Term Type="Out">Квантованный сигнал </Term>- сигнал, который принимает счетное множество значений</P>
<P><Term Type="Out">Цифровой сигнал</Term> - дискретный, квантованный сигнал.</P>
<P>С точки зрения математического описания различают также детерминированные (регулярные) и случайные (недетерминированные) сигналы.</P>
<P><Term Type="Out">Детерминированный сигнал</Term>, который может быть задан точными функциональными зависимостями от пространственных координат и времени.</P>
<P><Term Type="Out">Случайный сигнал</Term> -нельзя описать точными математическими соотношениями. Сигналы рассматриваются как выборочные или реализации из некоторого ансамбля сигналов, и математическое описание не для каждого отдельного сигнала (который есть случайная величина или функция), а для ансамбля(процесса) в целом. Эти сигналы описываются не точными выражениями, а при помощи осредненных характеристик.</P>
</Modul>
