<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="2G9N2KPI3A4GCCOYEST1" Level="1" ADate="ET1SKXCZ" Author="Волосатова">
<Title>Параллельные и векторные методы цифровой обработки сигналов</Title>
<P>Векторные компьютеры, концепция конвейеризации. Параллельные компьютеры, различные схемы соединения процессоров. Основные принципы векторизации алгоритмов цифровой обработки <Term Type="In">сигналов</Term> для векторных ЭВМ. Реализация алгоритмов цифровой обработки на параллельных компьютерах: параллельные вычисления по группам элементов изображений, по группам разрядов изображений, по группам элементов свертки. Систолические матрицы.</P>
<P>Литература:</P>

<List Num="Y">
<P>Л.П. Ярославский. Цифровая обработка сигналов в оптике и голографии. М:Радио и связь, 1987г.</P>
<P>Д. Даджион, Р. Мерсеро. Цифровая обработка многомерных сигналов . М: Мир, 1988г.</P>
<P>Р. Отнес, Л. Эноксон. Прикладной анализ временных рядов. М.:Мир, 1982г.</P>
<P>Р. Брейхут. Быстрые алгоритмы цифровой обработки сигналов. М.:Мир, 1989г.</P>
<P>Е.Ф. Очин. Вычислительные системы обработки изображений. Л. Энергоатомиздат, 1989г.</P>
<P>Д. Ватошен и др. Методы сжатия данных.</P>
</List>
</Modul>
