<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="BTSPPGMAW88GNGF655KC" Level="1" ADate="ET1RMWG9" Author="Волосатова">
<Title>Классификация сигналов</Title>
<P>При описании <Term Type="In">сигналов</Term> в первую очередь выделяются две наиболее общие характеристики:</P>

<List>
<P>множество значений, которые могут принимать сами сигналы;</P>
<P>множество значений, которые могут принимать формулы.</P>
</List>
<P>Исходя из этого можно представить следующую классификацию сигналов:</P>
<P>(Для классификации могут быть использованы разные критерии, поэтому можно предположить и разные классы сигналов).</P>

<List>
<P>Пространственный и временной</P>
</List>
<P>Пространственный и временной</P>
<P>Пространственный &#x2014; зависит только от пространственных координат. Наиболее часто- изображение- двумерный сигнал.</P>
<P>Временной &#x2014; зависит только от времени. Электрический сигнал в ЭВМ</P>

<List>
<P>Финитный и инфинитный</P>
</List>
<P><Term Type="In">Финитный сигнал</Term>&#x2014; множество значений координат ограничено</P>
<P><Term Type="In">Инфинитный сигнал</Term>&#x2014; множество значений координат неограничено</P>

<List>
<P>Аналоговый(<Term Type="Out">непрерывный</Term>, дискретный, квантованный, цифровой)</P>
</List>
<P>Аналоговый &#x2014; сигнал и его аргументы принимают непрерывные значения на числовых осях координат и значений.</P>
<P>Дискретный &#x2014; аргументы сигнала принимают лишь счетное множество значений</P>
<P>Квантованный &#x2014; сигнал, который принимает счетное множество значений</P>
<P>Цифровой &#x2014; дискретный, квантованный сигнал.</P>
<P>С точки зрения математического описания различают детерминированные(регулярные) и случайные(недетерминированные) сигналы.</P>
<P>Детерминированный- сигнал, который может быть задан точными функциональными зависимостями от пространственных координат и времени.</P>
<P>Случайный- нельзя описать точными математическими соотношениями. Сигналы рассматриваются как выборочные функции или реализации из некоторого ансамбля сигналов, и математическое описание не для каждого отдельного сигнала(который есть случайная величина или функция), а для ансамбля(процесса) в целом. Эти сигналы описываются не точными выражениями, а при помощи осредненных характеристик.</P>
</Modul>
