<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="5B5V7LC8UDHEELLBM15S" Author="kylagin" Level="1" ADate="EU4IV1NL">
<Title>Модели изображений</Title>

<List Num="Y">
<P><Term Type="Out">Черно-белая модель Bitmap</Term>. Каждому пикселу ставится в соответствие 1 бит-0, если цвет белый и 1, если цвет черный &#x2014; битовая карта</P>
<P><Term Type="Out">Полутоновые изображения. (grayscale</Term>) Пиксел полутонового изображения кодируется 8 битами(1 байт). Глубина цвета такого изображения составляет 8 бит, каждый пиксел может принимать 256 различных значений. Значения, принимаемые пикселами назывются серой шкалой. Она имеет 256 градаций ерого цвета.</P>
<P><Term Type="Out">Индексированный цвет</Term>. Первые цветные мониторы работали с ограниченной цветовой гаммой. Они кодировались или 4 битами(16 цветов) или 8 (256 цветов). Такие цвета получили название индексированных цветов. Индексированные цвета кодируются обычно 4 или 8 битами в виде цветовых таблиц. Например, графическая среда Windows 95 поддерживает цветовую таблицу из 8 бит/пиксел.</P>
<P><Term Type="Out">Полноцветные изображения</Term>. К ним относятся модели с глубиной цвета не менее 24 байт на пиксел (не менее 16,7 млн. оттенков). Поэтому их иногда называют True Color(истинный цвет). Битовый объем каждого пикселя распределяется по цветовым составляющим.Каждый цвет кодируется 8 битами. Цветовые составляющие обычно в программах организуются в виде каналов, совмещенное отображение каналов и определяет цвет изображения. К таким моделям относятся:RGB,CMYK и другие.</P>
</List>
</Modul>
