<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="HV9Y9I6O1CN2T9SINIR2" Level="1" ADate="EU5K731S" Author="Волосатова">
<Title>Форматы файлов изображения</Title>
<P>Формат PCX (фирма z-soft). Создан для программы PC PaintBrush. Практически любое приложение, работающее с графикой, импортирует его.</P>
<P>Однако, есть трудности при работе с CMYK&#x2192; невозможно применение в издательских системах при создании цветных публикаций.</P>
<P>Формат BMP- предназначен для Windows. Поддерживается всеми приложениями Windows. Используется <Term Type="In">индексированные цвета</Term> &#x2192; неприменим в издательской работе.</P>
<P><Term Type="Out">Формат TIFF</Term> (Tagged Image File Format)-универсальный формат (файл с расширением TIFF)</P>
<P>Достоинство- переносимость на различные платформы- IBM или Macintosh. Импортируется во всех издательских программах.</P>
<P><Term Type="Out">Формат PSD</Term> (Adobe Photo Shop Document)- внутренний для программы Adobe Photoshop. Поддерживает все модели изображения. Не унивнрсален, не импортируется программами верстки и объектной графики.</P>
<P><Term Type="Out">Формат JPEG</Term> (Joint Photographic Experts Group) Сохранение точечных файлов со сжатием(расширение .jpg). Поддерживает <Term Type="In">полноцветные изображения</Term> в моделях RGB и CMYK.</P>
<P>Алгоритм сжатия с потерями. Не существенен для Internet или принтерных распечаток, но катастрофичен для типографии (сжатие от 5 до 15 раз).</P>
<P><Term Type="Out">Формат GIF</Term> (Graphics Interchange Format)- в основном для работы в Internet (Compuserve- разработчик). Поддерживает только индексированные изображения.</P>
<P><Term Type="Out">Формат PCD</Term> (Photo CD) (Eastman Kodak Corp)-для настольных редакторских систем. Используется для создания каталогов изображений. Полезно- определение требуемого разрешения при импорте.</P>
<P><Term Type="Out">Формат EPS</Term> (Encapsulated Post Script) формат описания изображений на языке Post Script для полиграфических целей(универсальный формат для точечных и векторных изображений, текстовой информации)</P>
</Modul>
