<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="KO7SZD42A55EWTV47QVN" Author="kylagin" Level="1" ADate="EU707J7W">
<Title>Алгоритм JPEG</Title>
<P>Оперирует с областями 8х8 на которых яркость и цвет меняются плавно. (Joint Photographic Expert Group)-подразделение в рамках ISO.</P>
<P><Font U="Y">1 шаг</Font></P>
<P>Перевод изображения из стандарта RGB&#xA0;в цветовое пространство YCrCb(YUV).</P>
<P>Y-яркостная составляющая, Cr,Cb- красный и синий цвета.</P>
<P>Преобразование связано с тем, что глаз менее чувствителен к цвету, чем к яркости. Поэтому массивы Cr и Cb можно архивировать с большими потерями.</P>
<P>Матрица переход:</P>
<P><Formula><LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">Y</M><M X="0.5" Y="2.6" Kh="1.0">Cb</M><M X="0.5" Y="4.0" Kh="1.0">Cr</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr>=<LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">0,299     0,587       0,144</M><M X="0.5" Y="2.6" Kh="1.0">0,5       &#x2212;0,4187  &#x2212;0,0813</M><M X="0.5" Y="4.0" Kh="1.0">0,1687  &#x2212;0,3313    0,5</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr> * <LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">R</M><M X="0.5" Y="2.6" Kh="1.0">G</M><M X="0.5" Y="4.0" Kh="1.0">B</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr> + <LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">0</M><M X="0.5" Y="2.6" Kh="1.0">128</M><M X="0.5" Y="4.0" Kh="1.0">128</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr></Formula></P>
<P>Обратное преобразование:</P>
<P><Formula><LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">R</M><M X="0.5" Y="2.6" Kh="1.0">G</M><M X="0.5" Y="4.0" Kh="1.0">B</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr>= <LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">1    0             1,402</M><M X="0.5" Y="2.6" Kh="1.0">1   &#x2212;0,34414  &#x2212;0,71414</M><M X="0.5" Y="4.0" Kh="1.0">1    1,772       0</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr> * <LogBr><M X="0.0" Y="1.25" Kh="1.25">(|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">Y</M><M X="0.5" Y="2.6" Kh="1.0">Cb</M><M X="0.5" Y="4.0" Kh="1.0">Cr</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|</M></LogBr> &#x2212; <LogBr><M X="0.0" Y="1.25" Kh="1.25">|</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="3" Alg="0"><M X="0.5" Y="1.2" Kh="1.0">0</M><M X="0.5" Y="2.6" Kh="1.0">128</M><M X="0.5" Y="4.0" Kh="1.0">128</M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">|)</M></LogBr></Formula></P>
<P><Font U="Y">2 шаг</Font></P>
<P>Разбиваем исходное изображение на матрицы размером 8х8. Из каждой матрицы формируем 3 рабочие матрицы ДКП (по 8 бит отдельно для каждой компоненты)</P>
<P>Для сильных сжатий- компонента Y- полностью, а компоненты Cr и Cb &#x2014; через столбец.</P>
<P><Font U="Y">3 шаг</Font></P>
<P>Вычисляем коэффициенты ДПФ</P>
<P><Formula Br="Y">Y[U,V]= <Fraction><M>1</M><M>4</M></Fraction><Limits><M>7</M><M>&#x2211; </M><M>i=0</M></Limits><Limits><M>7</M><M>&#x2211;</M><M>j=0</M></Limits>C(i,u)C(j,v)y(i,j)</Formula>где <Formula Br="Y">C(i,u)=A(u)cos(<Fraction><M>(2i+1)u&#x3C0;</M><M>2n</M></Fraction>),</Formula><Formula Br="Y">A(u)=<LogBr><M X="0.0" Y="1.25" Kh="1.25">{</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="2" Alg="1"><M X="0.5" Y="1.19" Kh="1.0">1/<LogBr><M X="0.0" Y="1.25" Kh="1.25">&#x221A;</M><M X="1.25" Y="1.12" Kh="1.0">2</M><Z X="2.25" Y="1.25" Kh="1.25" /></LogBr>  ,u=0</M><M X="0.5" Y="2.6" Kh="1.0">1,  u&#x2260;0</M></Matrix></M><Z X="2.25" Y="1.25" Kh="1.25" /></LogBr></Formula>ДКП применяется к каждой рабочей матрице 8х8. В результате- матрица ДКП- коэффициентов. Коэффициенты в левом верхнем углу -низкие частоты, в правом нижнем-высокие частоты.</P>
<P><Font U="Y">4 шаг</Font></P>
<P>Квантование для каждой компоненты</P>
<P><Formula Br="Y">Y<Sub>q</Sub>(U,V)=InterRount<LogBr><M X="0.0" Y="1.25" Kh="1.25">(</M><M X="1.25" Y="1.12" Kh="1.0"><Matrix Col="1" Row="1" Alg="1"><M X="0.5" Y="1.2" Kh="1.0"><Fraction><M>Y(U,V)</M><M>q(U,V)</M></Fraction></M></Matrix></M><M X="2.25" Y="1.25" Kh="1.25">)</M></LogBr></Formula></P>
<P>q(U,V)-пороговое значение, которое задается для каждой рабочей матрицы Y,U,V-матрица квантования(MK). Здесь максимальные потери.</P>
<P>В стандарт JPEG- специальные MR, построенные опытным путем. Коэффициент &#x263; позволяет получить большее или меньшее сжатие умножением на них.</P>
<P>Специальные эффекты:при больших значениях &#x263; потери в низких частотах могут быть так велики, что изображение распадется на квадраты 8х8. Потери в высоких частотах- эффект Гиббса. Где резкий переход цвета образуется &quot;нимб&quot;.</P>
<P><Font U="Y">5 шаг</Font></P>
<P>Матрицу 8х8 переводим в 64-элементный одномерный массив(алгоритм &quot;змейка&quot;) В начале вектора коэффициенты, соответствующие низким частотам-НЧ, а в конце -ВЧ.</P>
<P><Font U="Y">6 шаг</Font></P>
<P>Свертываем вектор с помощью алгоритма группового кодирования: результат- пары чисел типа &lt;пропустить число&gt;, где &lt;пропустить&gt;-счетчик пропускаемых нулей, &lt;число&gt;-значение , которое необходимо поставить в следующую ячейку.</P>

<Example ID="EUBIZ3N5">
<P>42,3,0,0,0,-2,0,0,0,0,1<Formula>=&gt;</Formula>(0,42),(0,3),(3,-2),(4,1)</P>
</Example>
<P><Font U="Y">7 шаг</Font></P>
<P>Свертываем получившиеся пары кодированием по Хаффману сфиксированной таблицей.</P>
<P>Обратное ДКП</P>
<P><Formula Br="Y">y[i,j]=<Fraction><M>1</M><M>4</M></Fraction><Limits><M>7</M><M>&#x2211;</M><M>u=0</M></Limits>  <Limits><M>7</M><M>&#x2211;</M><M>v=0</M></Limits>Y[u,v]C(i,u)C(j,u)</Formula></P>
</Modul>
