<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="P7D8J3CTASLLXHK2VW4C" Author="kylagin" Level="1" ADate="EU1EQWJA">
<Title>Введение в параллельные методы цифровой обработки сигналов </Title>
<P>Использование достижений СБИС- технологий позволило подойти к задаче конструирования алгоритмов с иной стороны: а именно возродить старые принципы реализации, которые были более трудоемки с точки зрения обычных ЭВМ и отказаться от вычисления с помощью БПФ.</P>
<P>Недостатки вычисления с помощью БПФ:</P>

<List Num="Y">
<P>необходимо дополнять нулями сигнал и импульсный отклик.</P>
<P>Жестко заданы отсчеты спектра. Отсчеты спектра и отсеты сигнала связаны соотношениями:</P>
</List>
<P>&#x2206;t&#x2219;&#x2206;f=<Fraction><M>1</M><M>N</M></Fraction> , где <Formula>N</Formula> общее число отсчетов.</P>
<P>Это не всегда удобно при спектральном анализе.</P>
</Modul>
