<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="GMOOQQO9OIBLTG93ITTI" Author="kylagin" Level="1" ADate="ETT20VUI">
<Title>Реальный сигнал</Title>
<P><Term Type="Out">Реальный сигнал</Term>-результат наложения детерминированного сигнала и случайного помехового сигнала.</P>
<P>Случайный сигнал(помеха)-результат (с точки зрения описания) <Term Type="Out">статистического моделирования</Term>. При статистическом моделировании результат получается путем того или иного усреднения характеристик и данных, получаемых в наборе отдельных экспериментов. Поэтому статистические модели характеризуются:</P>

<List>
<P>наличием генератора случайных чисел;</P>
<P>наличием блоков вычисления статистических характеристик.</P>
</List>

<List />
<List /><P>Случайные сигналы генерируются в виде реализаций псевдослучайных последовательностей с заданными статистическими свойствами.</P>
</Modul>
