<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="KR8G5CM1NGX5YQSDIBQ8" Author="Горшкова" Level="0" ADate="EU3QNZ4I">
<Title>Нелинейные алгоритмы обработки сигналов</Title>
<P>Основной класс нелинейных алгоритмов - <Term Type="Out">ранговые алгоритмы</Term>, основанные на быстрых алгоритмах вычисления локальных гистограммных характеристик. Ранговые алгоритмы осуществляют нелинейное преобразование сигнала <Formula Br="Y">b<Sub>k</Sub>=&#x3A6;<Sub>k</Sub>(a<Sub>k</Sub>),</Formula>причем <Formula>&#x3A6;<Sub>k</Sub></Formula> - функция, вид которой определяется некоторым подмножеством так называемых рангов или ранговых выборок отсчетов,&#xA0;образованных данным отсчетом сигнала и отсчетами в заданной окрестности сигнала.</P>
<P><Term Type="Out">Ранг</Term> - это номер элемента в вариационном ряду, составленном из отсчетов в заданной окрестности. Он показывает,&#xA0;сколько элементов выборки имеет значение,&#xA0;меньшее,&#xA0;чем значение данного элемента.</P>
<P>Ранг называется локальным,&#xA0;если выборка образована фрагментом сигнала (окрестностью).</P>
</Modul>
