<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="3K9SVLY0UYBLAOPZUO9P" Author="Федорук Е.В." Level="0" ADate="EUFEW3BY">
<Title>Двоичная арифметика</Title>
<P><Term Type="Out">Двоичная арифметика</Term> включает в себя <Term Type="Link">арифметические действия над двоичными числами</Term>.</P>
<P>Правила выполнения арифметических действий над двоичными числами задаются таблицами двоичного сложения, вычитания и умножения:</P>

<Table Col="3" ID="EX7LT5CV" TTop="Y" Center="Y">
<P>Слагаемое 1</P>
<P>Слагаемое 2</P>
<P>Сумма</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>1</P>
<P>1</P>
<P>1</P>
<P>0</P>
<P>1</P>
<P>1</P>
<P>1</P>
<P>0 (единица переноса в старший разряд)</P>
</Table>

<Table Col="3" ID="EX7LXPBM" TTop="Y" Center="Y">
<P>Уменьшаемое</P>
<P>Вычитаемое</P>
<P>Разность</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>1</P>
<P>1(заем единицы из старшего разряда)</P>
<P>1</P>
<P>0</P>
<P>1</P>
<P>1</P>
<P>1</P>
<P>0</P>
</Table>

<Table Col="3" ID="EX7M5PTK" TTop="Y" Center="Y">
<P>Сомножитель 1</P>
<P>Сомножитель 2</P>
<P>Произведение</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>0</P>
<P>1</P>
<P>0</P>
<P>1</P>
<P>0</P>
<P>0</P>
<P>1</P>
<P>1</P>
<P>1</P>
</Table>
<P>Правила арифметики во всех <Term Type="Link">позиционных системах счисления</Term> аналогичны. Поэтому сложение двух чисел в двоичной системе можно выполнять столбиком, начиная с младшего разряда, подобно тому, как это делается в десятичной системе. В каждом разряде в соответствии с таблицей двоичного сложения производится сложение двух цифр слагаемых или этих двух цифр и 1, если имеется перенос из соседнего младшего разряда. В результате получается цифра соответствующего разряда суммы и, возможно, также 1 переноса в старший разряд.</P>
<Image ID="EX7LN8T2" DDImg="-7РОЗB8O+8+++BЙИUДТ+++o++++щ60++A+TЩQD++++2зБНБ+K+lD9ьб3++++4вЛЗФД+я+я+яDUxbH++++7рИЩу+++9G++9G-9ТЭюь+++А5фЙНЕ5ЧU-JCuQWюVbK++28ЙрДБФшQнЬбxКfБMЖсбНlаPРlFб+rагV8tШ5fлjЕЛр0eg3Xвге6dвей5вм1ФЖВIу8БPЦмyvпмqПNЩЙяЧQВ8kомМужзbгwЫOC57ПEзTпHАsc65YВ-7р6АWQE65Y3В-7рАWQСE65YВ-7EрАWQE658YВ-7рАWWQE65YВ-V7рАWQE6ф5YВ-dныф2ВСкpmBonЮФHоМсьъъuqqжЪчБЮMpьЛхч2гУ8цrрDррРнц9ООjr1xсДfюpъfИqМOыUЯяйЗHЫлБЮШЬбYеzчuуЫшУVхЫЮРtчайфfЪцQТнХ7ЮЪеgtМЖЮyЛвЧeГйlFЭяцТВЭшуoВИуошЕMtgтпзQsuvRVфИУhИZбkтъkДтvзiКeTFЖIiuбЮЦrSTTяяpчxkrЦWKЙUюШбЮhIОTЫЖЫ2ЛVGLЯvJдпxГсЯ67sСcьrЛGнttdYЬюр2ПыЭДYd3ыЩ-ч21тТдHXЖБМВ-7рАWQEc65YВ-7рkА8lQЖhю-эюяееесyссааUЪFФФгйEЖэ5tBrAПэээуцДЖOjjjяrrrпооSгSSqrrППJПЭDРРШueДБПЕYРчзMыfПrооzоцыэTЧзUззvvviЗEcоgR0рш0УъdijjDC41TЧппп6ЛЛЛiЗcоРgRвKВFизЧзZvйЫнzцЗЗЗЬЬЬэGYЯЯЯууDуTTTОЗcРоgRWъzЙАaбiИhuRяОыыыПлЧTЧЧ333aCCFsa4гггягвввзхеhееjЧлвEГVушЙУ41ъБGYzЧыЬяЖXXXхххzЗЗЗЫЫЫЮСjчххеъ250ЖТV8юeдaV4XrsЩпЖэээОbУVнцПООeR0Vrсхххпuпjш6EялпХИГeeрZяЬЛЛЛЦЦЦпННBпHсjBdлCЙtww6wyyцэKБъажMхххХgоУОHYУA25DАиQжC0ИgtUFCИDМрEOlуMючъФmэbВzsСтцхP9эЛОTuqяsJCPlж2гиЫШйУгцTbgсXЦИрдоыГdсыDУsЬFлМ0oфbцПBЫяQЖhПйэ3cN9ТqFtЫрШюУ3vЖ4XчPCxЫякзхWжqеЩйУЧцTNЧсXЦAрдзXQvBзьнKzйRyцсглХM3йфkУqbhFлCЙбСbПOnЗTмсфЙXQEsg6АWQE65YLT9jиSeT5лuB3dYiWfE65YВ-V7рАWQE6Q5YTбMДpЯ8эlmK8IъкХiсрsLHYцкIыгеЩBJcХeЭWУбщНapЦXСШTfлjАЙэН-бMКрpЖЦXШTfлjжАNершюъHwЮкIыгеЩнJcХeЭвyEРЭКшХcLцОnЦ-ТНкАбMzOЕЮmщжeРeсшqЙfxOЕюШРЩг3КpкLвишAЗqUгжЧXШTfPЫ1noоЕpЖйрaKЦцФhY43oж6-хfвйМQяРrGUЖsUсЩ-ДUsUFCИ214Gб+ДsUFдCИ21Gб+АДsUFCИ2A1Gб+ДsUИFCИ21Gб-+ДsUFCИN21Gб+ДsEUFCИя-Nn2VщЛCзЕ+++++ЙЕОGДiВа0">Сложение</Image>
<P>Вычитание чисел в двоичной системе выполняется подобно вычитанию в десятичной системе. При вычитании в данном разряде при необходимости занимается 1 из следующего старшего разряда. Эта занимаемая 1 равна двум 1 данного разряда. Занимание производится каждый раз, когда цифра в разряде вычитаемого больше цифры в том же разряде уменьшаемого.</P>
<Image ID="EX7LOWN2" DDImg="-7РОЗB8O+8+++BЙИ+ДТ+++ф++++й60++A+дkEp++++2зБНБ+K+lD9ьб3++++4вЛЗФД+я+я+яDUxbH++++7рИЩу+++9G++9G-9ТЭюь+++А5фЙНЕ5ЧU-JCvVгB-ЪЖ++1pЙрДБФшQнPжzeкАI5HКзАqUвX0цPklEЕмБлКЪЕs0Lа0eg3Xвгеsdвеd0MКkнgДljEчztЬДьуюaKnDЯЧ31nдbю7гтCXЗvifFAяТKy-яNК3ВVtАcL6е0dVЬUI92тF-РiEК3ВVtАcL6е0dVЬUI92тF-РiEК3ВVtАcL6е0dVЬUI92тp-АдОbУкdpOOoнvФЮeеущБаEmм4ПТ6А3jkЯпxnя6чiЧлЦfpЫчнCЗгXСMXПзсз6НPсQВ+EtiлJъЪшSмфuhqнzCзnЩЗvЭCvГиЮFРIиТHЫg2KRЗщRЯiеLВVEч4РЫwVdРиiжнDшuоnучЩUбMrЫhHНЙиOцьynLЩмэюDpГ4иЮРIиТыиЪkНуъxybCПзуiLУшlЕkdЙhЧjл9ЕвхwЬ2ihЛТlЕ6З6pЖсQНУPyЦvЯаиoЫeХк5ГбvнЭЪKpЪhвZОEOrs3+ШUтэjQrШлпчНУgLЛfHЙYЩAJК5ZЫнaЛV+ZФDOMОbУЗnЩЬмqйTЩ6zкzюC5ЫГсшQцЩwOЕнvчсшMЧ4FцЩwZбяRfяXЧлэео7ЕВжnOэкчiдcxж2КCе0FbL4ФдэдIQбaПФUWпвСQ0EOХчГкШTLщHBG+дЬтHJщHBЖG+РЗlРFтrЩc-ИхoлEg0PъЭцYRтЙНЦ-Н3zоыCб9EЧcИPшI+ДЯЙхxQЮаg0WпЧxrойИШAкЧKШПв3ВъiEЙлнtкЛJQpLK3Й-ьbфЭфЗМыf6ьa6тЩ+Ве-6Zе0VЬUI9CДcЬиvRьГ1БPQдмXс7gдДЯйаШB4rКдмXh7ОйыVX2с1PетqСIхFPЬcHnBТaъZWъО5qTБаЖNQнIoеSK0PеЮтqСIFPЬCcHoBaтBD8yУБPAозIЙЩЖHэbeEпJBSфнbIЙЬЖУyeРaуPНNpчwRmrСIzу2еоXdjЧжСIЯKд4т-ИРiEК3ВtРАcL6е0VФЬUI92т-ИРiEК3ВtРАcL6е0VФЬUI92т-ИРiEК3ВtРАcL6е0VФЬUI92т-ИРiEК3ВtРАcL6е0щC9JКSQцБ+KH++++ЙИЕОДiВа0">Вычитание</Image>
<P>Умножение двоичных многоразрядных чисел производится путем образования частичных произведений и последующего их суммирования. В соответствии с таблицей двоичного умножения каждое частичное произведение равно 0, если в соответствующем разряде множителя стоит 0, или равно множимому, сдвинутому на соответствующее число разрядов влево, если в разряде множителя стоит 1. Таким образом, операция умножения многоразрядных двоичных чисел сводится к операциям сдвига и сложения. Положение запятой определяется так же, как при умножении десятичных чисел.</P>
<Image ID="EX7LQ716" DDImg="-7РОЗB8O+8+++BЙИUДТ+++4+2++B60++C+эЬJ3++++2зБНБ+K+lD9ьб3++++4вЛЗФД+я+я+яDUxbH++++7рИЩу+++9G++9G-9ТЭюь+++А5фЙНЕ5ЧА-JD+D0f0Т4++2сЙрДБФшQнQVzКfБI5чжпьУ4og3-ШЩ7йgДk9pKЦжэь2RЯБДВЖWGaмДВТМSАД3lШM937fsr6ЬfЙояQnЙМьжмЧпfвбИОьШqыцзQМQtaйДEшгыk0дIe-1КHаUGsc2Cqe-1КаUGвsc2Ce-1aКаUGsc2gCe-1КаРчWYЭоЧлхыTFЦfpuu5uwwьффoЦщд2шЮаvбYeшьььщюЩuЭоОООяГГГуууцпццХХХЮИПЙсwБЦСWьYНУTяv1911ЦfpьэwщщtzzTrЗтЧsыZсeЫZРPЗяzЛЫКККbУЙGюY8WrrrхяххLLLМFОщпрлаыирФmrrчщщкЩdФWcъю-юЮЬЬQA4эNXуЮбЧБhцРGЮЗcЦяfпппГЧjГjjЛЛЛюзьXВbGhhhяPPPблЫЫBЫЖXбчymТQзiЛфъxъc8ъxЮрПяуууНННbЯbbыыыЖX6сччLrттIwпkХIcNвzГCDDfХякЪЪЪЕЕЕ9дFHвЮОЬвxйЭBбдGяHHH333г3ггЯHсБ+юКкхъЧЧЧьаkшшшШШУШрxRл2UЯдффoЭоЗ+сьэээцц7жыuЦ7АЙЯnЩЬЫЫЛУШфччrЩмъгSCх0РТнъцгsSTTjoФeRОЗчфГgГvis0шHKMkеxДЪSЬl9Л5UыАМУjdРЬlй8GZйIхGТвЕJыиФGЮYЙz3dюzCЯfХтЖК5+vАПъjЬjшdЦЬl5GфKy0cЮ0ЦЬXСdДФj-fЕisyРЪвOЬъЙ-в8ХIccNzГДхGдйсЕeъТvwOфжGUVGвsc2Ce-1aКаUGsc23CtЯHcИQЫЗоDкжNCPD8ррВ351JАБZрР7kQФ05JАБkZрcСВЭVЧааоE6ДЬ6R0BоC-5qч5+4h-СV2ОZрBAW0QзiЛрч6KsЖПkоCБ4ж4ОЬGoФA05JАБZрEР7QЦIшйNmТ1оrДХь7Д2B5RNrwhaG66ЩAОожКXhZШEFЦSЮзp5Uha2WWMдZБLАДаaхчF0i-6k5WДЖtMц7жД2LAж0aWG66ЬZгbвНsZEFР7viQ2HЮЛ11JАБZрР7ИQФ05УZешЭпLбтCvroлнWQяшjWIлнWQчfкLтxЭ2ПвZеЩпLбуPCfwлнWьФedСъv6LЯ7foлнWQаeNzDКmЮ+iВПЦФ1LaФаUGsc2мCe-1КаUмGsgпHgхZraцSSшЬ+05jЬрР7kQФ05JАБаZрР7QSыBsДБМшжbБMщРфgЗsЖgОMчбNцMсец0N5ЕhЗт4Пyi0LБФUHМwceuKnВЦGYчЙzGыzЯjЭХкWUиШО5рЩЗХUMNaф0N5ЕЗтmЖШчЬNRайжБМВЦGЩk7жS2ЕеХvТw9ЛkDfЕnHМwcuKфnwчс70NусМОkуUииШоаx2Ck8у7Кc2CeP-1КаUGslc2Ce-1КHаUGsc2Cqe-1КаUGвsc2Ce-1aКаUGsc2vCzкгМмР0уЯн++++EЙЕОДiВа-0">Умножение</Image>
<P>Деление чисел в двоичной системе производится аналогично делению десятичных чисел. Достаточно рассмотреть деление двух целых двоичных чисел, так как делимое и делитель всегда могут быть приведены к такому виду путем переноса запятой в делителе и делимом на одинаковое число разрядов и дописывания 0 в недостающие справа разряды.</P>
<Image ID="EX7LQXAH" DDImg="-7РОЗB8O+8+++BЙИUДТ+++U+2++I60++O+PЖpБ++++2зБНБ+K+lD9ьб3++++4вЛЗФД+я+я+яDUxbH++++7рИЩу+++9G++9G-9ТЭюь+++А5фЙНЕ5ЧU-JD--ь60ОА++3РЙрДБФшQнRеxОлМE4RhDИoF+30AVСРТРUElt5eкi3ЛBаecF6Вo8ФI6cc-72FСрУРUEьyЕфRTДvЬSпмЭNrпмУЕPJзRЗыЙixГТКуQwXsьLъ+-YЩcMQ84D50БVарcрMQ8450Б-VарcMQ8S450БVарРcMQ8юГftХКx2ъ7eЗшфффннhDolЯпjhhЗНППTQQI1qvu9гЙ4cЩdоZn8БюSF555с6вXBrrrЫЫDЫчччПППяPPPзззSРцЧзбgF4QпЙЖг7fzсXsДJQяяАVъOчччыяэюрхЩЩЩzООCbЭХЩЦMЛхЦйшьВс3зI5х0ЗvЭоаkMyАюыыЫШШргovu9гtЮфeRDziрAЯвРКгЦдpИЪ3FяомrDЫTTTnnnюЩKэььМОlОюээtЪЭзR3lЬпJC-ЗTЧшЖсР5r8офuTTyTГЧjjjудууSцЧзaFЗУdо2БъаРbшгггвэввшъттmлЧлщЪЭRPМSПZsF4йВXжьkMAm0gыxVJqSQRRhjjzyЮyЮЭЭхъxуfffПvfn8kЦ6ГПГmcSПЬщNЕVjeаВfкwсQяяzУйgjюjTQQьЭnЗkЭХЩMлдВЭщшЬсfRРС2вjmoгQЩяЩZRъ+пu6цomЪJSДБя+чBЦлr8aхВБашРksхМБzСЧaшуMхкIFМjкбПo0s7fuМIЛLИ1KЦAИКИКкaжгnеЕЕGiПГSФ6ЯlWйРvdCHюЪ8ZwTNxwиdzdGГghШВcsU9AYТ5ъЙЩЗСVhШВТм2СOooгFtXZFтJнoШ2Wн3ЖХТ8ШqЪgFsВXoelз1еЕGFiПГSФЯlGWйРv7fuиФJЛs2Л1АKюнЦЦЦцГццwRO3kR4VM4KzjаjjЫЫЫrrгrpTЩВY2ояМzл8KФ1РpюшшшьiьЬДFZрPxЬsЯЯЯнцгmКN845Щ+YрcMQ84ЦЗdа7ч0EдT-TичЬJСMдj+щFaВ-xзЫиWfСGAixВoUxчqdфПrLьLLjjjvЭъоKепппfяffПППJCфkBиxЫаxe+дЗM4IiэmYШКЛaВСkагщЩФYЧOьэМmL+нь6У+ТБ3уЧЯшгZМlBfFPйЪсМжV4заW-01БVарcMQЬ8450БйwцMAvvY3чЫБаиь7qu0F+ТGzЙfmВщЖ+qРcKsЧxF+hAЦ6ЦqF+hI0imoп2а9LB9gFAо2NU210Bо2ЗU3ДУДFКмr0k3ЖБгОLTeB+мVкфFЕкВЧKjюdюБfрХБОпks4ЦС+дGcMQ84П50БVарМU6жJАU7T1o6бJАMжж2зg06ВekаЦ-6lфYF9Х+-MЩд1BАe+VЦ3Fn8АКвdВ8Af+ВkXшHь8дJ+2ЛЩ9gG+ХtMs6СССБzАфмCюД1ГTАирcMQn0СNiAYснO8Ma9ГkXsтзuk6f0NиiIвйq7йJВ+МgmЖаJuР6ХБМLРКЙwЕ6бuskAn0ЗjИБa9ZШЪдFш+ФдHьMш9пбкбrMQуffиW20Б-VарcMQЛг0е7аЧWrшк8N-ДчбWвд7аЧWrкU3A+NБтe2kfСPKВЫqCNБт2kкfСPKВqCdN5Rт2kfхСPKВqCNТЕKw-мКфЪОSВq6NБJт2kfСvщO8ЩYdз6dХт2kfСPEwВ4АAаwКy0ШJиhOВq4АМW92б+жCaбРksРIAC31ГБ-аРksIACO31ГБаРkUsIAC31Г1БаРksIAoC31ГБаРАksIAC31ЖГБаРksza+Vn+T5L1яH++++ЙИЕОДiВа0">Деление</Image>
<P>Благодаря простоте правил двоичного сложения, вычитания и умножения применение в ЭВМ двоичной системы счисления позволяет упростить схемы устройств, выполняющих арифметические операции.</P>
</Modul>
