<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="9676IZR6NOY45Z3VNJL5" Author="Федорук Е.В." Level="0" ADate="EUJTZDE9">
<Title>Синтаксис и семантика языка программирования</Title>
<P>Термином <Term Type="Out">язык</Term> в широком смысле слова обозначают любое средство общения, любую систему символов или знаков для обмена информацией.</P>
<P><Term Type="Out">Алгоритмический язык</Term> &#x2014; набор символов и система правил образования и истолкования конструкций из этих символов для задания алгоритмов.</P>
<P>Алгоритмический язык для записи программ и данных называют <Term Type="Out">языком программирования</Term>.</P>
<P>Любой язык, в том числе язык программирования, подчиняется ряду правил. Их принято разделять на правила, определяющие синтаксис языка, и правила, определяющие семантику.</P>
<P><Term Type="Out">Синтаксис языка</Term> &#x2014; совокупность правил, определяющих допустимые конструкции (слова, предложения) языка, его форму.</P>
<P><Term Type="Out">Семантика языка</Term> &#x2014; совокупность правил, определяющих смысл синтаксически корректных конструкций языка, его содержание.</P>
<P>Языки программирования относятся к формальным языкам, для которых, в отличии от естественных языков однозначно определены синтаксис и семантика. Описание синтаксиса языка включает определение <Term Type="Link">алфавита</Term> и правил построения различных конструкций языка из символов алфавита и более простых конструкций. Для этого обычно используют форму Бэкуса-Наура (БНФ) или синтаксические диаграммы.</P>
<P>Семантику языка программирования закладывают в его компилятор. Таким образом, синтаксически корректная программа, написанная на языке программирования, после преобразования ее в последовательность машинных команд обеспечит выполнение ЭВМ требуемых операций.</P>
</Modul>
