<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="CQH9A17E80L3TZG3R1P2" Author="Федорук Е.В." Level="0" ADate="EUJTR7Y0">
<Title>Технология программирования</Title>
<P>В настоящее время при разработке сложного программного обеспечения обычно используют одну из двух технологий: <Term Type="Out">структурное программирование</Term> или <Term Type="Out">объектно-ориентированное программирование</Term>.</P>
<P>Первая технология для разработки сложных программ рекомендует разбивать (декомпозировать) <Term Type="Link">программу</Term> на подпрограммы (процедуры, в языке программирования СИ &#x2014; <Term Type="Link">функции</Term>), решающие отдельные подзадачи, т.е. базируется на процедурной декомпозиции.</P>
<P>Вторая технология использует более сложный подход, при котором в предметной области задачи выделяются отдельно функционирующие элементы. Поведение этих объектов программно моделируется с использованием специальных средств, а затем, уже из готовых объектов, опять же специальным образом, собирается сложная программа. Таким образом, в основе второй технологии лежит объектная декомпозиция.</P>
<P>Изучение второй технологии требует наличия базовых знаний, поэтому в этом курсе мы будем изучать принципы структурного программирования.</P>
</Modul>
