<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="O70R69WXNXAZNPZV1DLX" Author="Грошев С.В." Level="0" ADate="ESVMVXWI">
<Title>Введение</Title>
<P /><SubTitle>Работа в Яндексе. Космические перспективы Новости15:25Все Москва     Цитаты в новостях</SubTitle>

<Table Col="4" ID="ESVMZ62C">
<P><Formula><Fraction><M>16</M><M>123132</M></Fraction></Formula>-летняя россиянка выиграла чемпионат мира по тяжелой атлетике </P>
<P>Третью Нобелевскую премию в науке получают американцы </P>
<P>День Космических войск в Чувашии отметили сбором юных космонавтов </P>
<P>Петропавловская крепость осталась без директора </P>
<P>Правительство одобрило концепцию развития аэронавигационной системы </P>
<P>В Москве с сегодняшнего дня начались пробные включения отопления </P>
</Table>
<Image ID="ESVMZIL0" /><P>Движение в центре Москвы ограничат </P>
<P>В России задержали группу грузинских и абхазских киллеров </P>
<P>Юрий Росляк поборется за атмосферу уверенности </P>
<P>Наркоконтроль и ГИБДД объединились для вымогательства </P>
<P> </P>
<P /></Modul>
