<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="6J2B961G9BKTJWGKF572" Author="Федорук Е.В." Level="0" ADate="EV3ZCL3Q">
<Title>Функции</Title>
<P><Term Type="Out">Функция</Term> &#x2014; это именованный фрагмент программы. Данные могут передаваться в функцию и функция может возвращать значение.</P>
<P>Программа на <Term Type="Link">языке Си</Term> состоит из <Term Type="Link">функций</Term>, произвольным образом упорядоченных в файле. Фактически функции могут быть размещены и в разных файлах. Концепция функции в языке Си покрывает все типы подпрограмм в других <Term Type="Link">языках программирования</Term>: функции и процедуры.</P>
<P>Функции позволяют писать модульные программы, в которых каждая функция выполняет собственную задачу. Функции обычно невелики (страница или меньше, могут быть и однострочные).</P>
<P>Функции позволяют избежать дублирования кода в одной программе. Кроме того, несколько программ могут совместно использовать код функции.</P>
<P>Программы легче читаются, так как детали &#x201C;скрыты&#x201D; внутри функций.</P>
<P>Программы легче пишутся, поскольку функции позволяют разбить большие задачи на задачи меньшего размера, более простые для решения.</P>
</Modul>
