<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="TQ9AI1ICGOG9A1WJDFJ3" Author="Федорук Е.В." Level="0" ADate="EUTW77PK">
<Title>Операторы</Title>
<P><Term Type="Out">Оператор</Term> &#x2014; это конструкция языка Си, которая вызывает выполнение действия.</P>
<P>В <Term Type="Link">языке Си</Term> существуют следующие операторы :</P>

<List>
<P>простые операторы</P>
<P>блоки операторов (<Term Type="Link">блоки</Term>, <Term Type="Link">составные операторы</Term>)</P>
<P>управляющие операторы</P>
</List>
<P><Term Type="Out">Простой оператор</Term> или <Term Type="Link">оператор-выражение</Term> &#x2014; это <Term Type="Link">выражение</Term>, заканчивающееся символом <Operator>;</Operator> (точка с запятой).</P>
<P>Специальным случаем простого оператора является <Term Type="Out">пустой оператор</Term>, который ничего не делает. Пустой оператор состоит из единственного символа <Operator>;</Operator> (точка с запятой). Он используется в тех случаях, когда <Term Type="Link">синтаксис</Term> языка требует наличия оператора там, где не требуется никаких действий.</P>
<P><Term Type="Out">Блок операторов</Term> (<Term Type="Link">блок</Term>, <Term Type="Link">составной оператор</Term>) &#x2014; это последовательность операторов, заключенная в фигурные скобки <Operator>{}</Operator>.</P>
<P>Блок используется для объединения нескольких операторов в один оператор. После закрывающей фигурной скобки точка с запятой может не указываться. После открывающей фигурной скобки можно объявлять переменные. Такие переменные, называемые <Term Type="Link">автоматическими</Term>, известны только внутри этого блока, после выхода из блока они больше неизвестны.</P>
<P>&quot;Тело&quot; функции также представляет собой блок операторов.</P>
<P><Term Type="Out">Управляющие операторы</Term> &#x2014; операторы языка Си, реализующие ветвления алгоритма, циклы и передачу управления.</P>
<P>Все управляющие операторы начинаются с <Term Type="Link">ключевого слова</Term>, такого как: <Operator>if, while, for</Operator> и т.д.</P>
</Modul>
