<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="AAJFP4W26X1ZW2FVA0SR" Author="Полякова В.Г." Level="0" ADate="EV1607AE">
<Title>Виджеты и встроенные средства Xt</Title>
<P>XToolkit можно разделить на два уровня:</P>

<List>
<P>встроенные средства &#x2014; основа, на которой строятся виджеты и прикладные программы. Они содержат средства для создания, организации и разрушения виджетов. Встроенные средства транслируют последовательности событий от сервера и вызова процедур, которые затем могут интерпретироваться виджетами и прикладными программами. Встроенные средства следят за состоянием конкретного виджета и согласовывают обустройство экрана, когда виджет изменяет размеры или позицию.</P>
<P>набор виджетов &#x2014; могут включать в себя содержание интерфейса прикладных программ.</P>
</List>
<P><Term Type="Out">Виджеты</Term> &#x2014; это компоненты пользовательского интерфейса, которые представляют собой комбинацию Х-окна и необходимые семантики для формирования объекта, при этом объект обеспечивает абстракцию пользовательского интерфейса.</P>
<P>Прикладные программы могут быть сконструированы таким образом, что они взаимодействуют с системой XWindow либо через Xt, либо с помощью комбинации Xt и Xlib. </P>
</Modul>
