<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="8ZS400R7ECDER2GG1T66" Author="Полякова В.Г." Level="0" ADate="EV15C5Y1">
<Title>Атрибуты (ресурсы) объектов</Title>
<P>Каждый из классов widget, а следовательно, и создаваемые на его основе объекты, имеют достаточно большое количество параметров. В терминах Xt они называются &quot;ресурсы&quot;.</P>
<P>Ресурсы объектов однозначно идентифицируются символическими константами, начинающимися с букв &quot;XtN&quot;. Например, класс Core имеет параметры XtNx, XtNy, XtNwidth, XtNheight, определяющие начальное положение окна на экране и его размеры. Класс Shell имеет атрибут XtNsaveUnder, &quot;говорящий&quot; о том, надо или нет сохранять содержимое экрана под окном при показе последнего.</P>
<P /></Modul>
