<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="3FMFI3JEYGEGIX9YJB08" Author="Полякова" Level="0" ADate="EV859IOV">
<Title>Механизмы обработки событий</Title>
<P>Встроенные средства XToolkit представляют два механизма для трансляции Х-событий в операции виджета:</P>

<List>
<P>управление событиями</P>
<P>управление трансляцией</P>
</List>
<P>Усправление событиями предоставляет механизмы для прикладынх программ Toolkit с целью получения информации о событиях и диспетчеризации с помощью диспетчерной процедуры этих событий. Причем, <Term Type="Out">управление событиями</Term> обеспечивает жесткую привязку всех событий к операциям внутри прикладной программы. Механизмы, предоставляемые менеджером событий так же обеспечивают использование таких не серверных событий, как сигнал таймера или извещение об ожидании файла данных.</P>
<P><Term Type="Out">Управление трансляцией</Term> так же реализовано во встроенных средствах и обеспечивает интерфейс более высокого уровня для обработки событий. Т.е. управление трансляцией обеспечивает обработку событий через применение структуры виджет-класса.  </P>
</Modul>
