<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="ANYZJ03Y7MFZGOJG1VY8" Author="werwer" Level="0" ADate="EN1JAZQA">
<Title>ewrrewrwer</Title>
<SubTitle>bvfgdfgdfgdfgfdgfgdfgfdgfdgdfgdfgdfgg</SubTitle>

<LitList>
<Liter ID="EN1K4RFL">fghfghfghfghfghfghfgh</Liter>
<Liter ID="EN1K4TZE">bhfghfghfghfghfghfghfgh</Liter>
</LitList>

<Note ID="EN1K4M66">
<P>Каждый из тестовых модулей соответствует одному заданию или упражнению, выполнение которых позволяет  обучаемому проверить свои знания или умение их применения для решения практических задач.    Тестовы База учебных материалов е задания могут быть различных типов, например, требующие выбора <Operator>правильного</Operator> варианта ответа из приведенного списка, решения задачи с получением фиксированного ответа</P>
<P>, синтеза принципиальной или<Font Face="1" Color="#DD00DD" B="Y" Size="2.0"> логической схемы, составления</Font> граф-схемы алгоритма и<Link To="EN1K14R2" />ли фрагмента программы и т.п.  Сопоставление  ответа с правильным результатом наряду с наличием комментариев и рекомендаций по изучению тех или иных разделов или модуле</P>
</Note>
<Image ID="EN1K14R2" DDImg="+ЗЙЖstбA++A+ч++V-я9НУПЖЖ+ЙГЕtikB++++-уТЗgВ+iОQй+0Vя9НУПЖ+ЖЙГЕtik+M+++Aну+ПРНУПЖЖ+ЙГЕtik0ПсNoK+Vя+9НУПЖЖЙ+ГЕtikM++++AгнРР+КГнрkrl+m0++-A5FЪP+Vщ2-+++++g++А++A+A+-DАААМж+-+01-010Iп2DdЛPСЮYутWЪjqзCУi+BС+++v">hjkmjhkjhkjhkjhkjhkjhkjhk</Image>

<Listing>
<L>456456456456 rtyrtyrtyr rth truyrtrturtuy45456</L>
<L>fhfghftghfghfghfghfghfgh fghfghfghfgh  fghfghfghfghhfgh jghj</L>
</Listing>
<P>й позволяет обучаемому осуществлять <Extern Type="doc" Name="1">самоконтроль успешности</Extern> освоения учебной <InlImage Alg="-1" />программы и целенаправленное устранение пробелов в полученных знаниях.</P>
<P>В любом из модулей  системы БиГОР во<Formula>jghjhgjghj</Formula>зможны <Formula Br="Y" Num="Y" ID="EN1K73HC">m =<Fraction><M><Indices><M /><Z /><M>q</M><M /><M /></Indices></M><M>y<Matrix Col="7" Row="8" Alg="1"><M X="0.5" Y="1.2" Kh="1.0" /><M X="2.5" Y="1.2" Kh="1.0" /><M X="4.5" Y="1.2" Kh="1.0">hgjghj</M><M X="6.5" Y="1.2" Kh="1.0" /><M X="8.5" Y="1.2" Kh="1.0" /><M X="10.5" Y="1.2" Kh="1.0" /><M X="12.5" Y="1.2" Kh="1.0" /><M X="0.5" Y="2.6" Kh="1.0" /><M X="2.5" Y="2.6" Kh="1.0" /><M X="4.5" Y="2.6" Kh="1.0" /><M X="6.5" Y="2.6" Kh="1.0" /><M X="8.5" Y="2.6" Kh="1.0" /><M X="10.5" Y="2.6" Kh="1.0" /><M X="12.5" Y="2.6" Kh="1.0" /><M X="0.5" Y="4.0" Kh="1.0" /><M X="2.5" Y="4.0" Kh="1.0" /><M X="4.5" Y="4.0" Kh="1.0" /><M X="6.5" Y="4.0" Kh="1.0" /><M X="8.5" Y="4.0" Kh="1.0" /><M X="10.5" Y="4.0" Kh="1.0" /><M X="12.5" Y="4.0" Kh="1.0" /><M X="0.5" Y="5.4" Kh="1.0" /><M X="2.5" Y="5.4" Kh="1.0" /><M X="4.5" Y="5.4" Kh="1.0" /><M X="6.5" Y="5.4" Kh="1.0" /><M X="8.5" Y="5.4" Kh="1.0">hgjhgj</M><M X="10.5" Y="5.4" Kh="1.0" /><M X="12.5" Y="5.4" Kh="1.0" /><M X="0.5" Y="6.8" Kh="1.0" /><M X="2.5" Y="6.8" Kh="1.0" /><M X="4.5" Y="6.8" Kh="1.0" /><M X="6.5" Y="6.8" Kh="1.0" /><M X="8.5" Y="6.8" Kh="1.0" /><M X="10.5" Y="6.8" Kh="1.0" /><M X="12.5" Y="6.8" Kh="1.0" /><M X="0.5" Y="8.2" Kh="1.0" /><M X="2.5" Y="8.2" Kh="1.0" /><M X="4.5" Y="8.2" Kh="1.0">hgjghj</M><M X="6.5" Y="8.2" Kh="1.0" /><M X="8.5" Y="8.2" Kh="1.0" /><M X="10.5" Y="8.2" Kh="1.0" /><M X="12.5" Y="8.2" Kh="1.0" /><M X="0.5" Y="9.6" Kh="1.0" /><M X="2.5" Y="9.6" Kh="1.0" /><M X="4.5" Y="9.6" Kh="1.0" /><M X="6.5" Y="9.6" Kh="1.0" /><M X="8.5" Y="9.6" Kh="1.0">ghjghj</M><M X="10.5" Y="9.6" Kh="1.0" /><M X="12.5" Y="9.6" Kh="1.0" /><M X="0.5" Y="11.0" Kh="1.0" /><M X="2.5" Y="11.0" Kh="1.0" /><M X="4.5" Y="11.0" Kh="1.0" /><M X="6.5" Y="11.0" Kh="1.0" /><M X="8.5" Y="11.0" Kh="1.0" /><M X="10.5" Y="11.0" Kh="1.0" /><M X="12.5" Y="11.0" Kh="1.0" /></Matrix><Sup>56</Sup></M></Fraction>   <LogBr><M X="0.0" Y="2.87" Kh="1.41"><Limits><M X="-0.0" Y="0.94" Kh="0.8">i=7</M><M X="0.0" Y="2.87" Kh="1.41">&#x2211;</M><M X="0.52" Y="4.57" Kh="0.8">0</M></Limits></M><M X="1.73" Y="2.66" Kh="1.0"><Indices><Z /><Z /><M>a</M><M>i</M><M>j</M></Indices></M><Z X="2.25" Y="1.25" Kh="1.25" /></LogBr>     <LogBr Ky="7.08" Kx="0.5" Arb="Y"><M X="-0.8" Y="8.34" Kh="7.08" Kw="0.5">{</M><M X="1.61" Y="5.3" Kh="1.0"><Free><M X="0.44" Y="2.0" Kh="1.0">gg<Fraction><M X="2.45" Y="1.17" Kh="1.0">df</M><M X="0.44" Y="3.62" Kh="1.0">d<LogBr><M X="-0.1" Y="1.94" Kh="1.25">&#x221A;</M><M X="1.07" Y="1.81" Kh="1.0">fgdf</M><Z X="4.1" Y="1.3" Kh="1.25" /></LogBr>g</M></Fraction>gg</M><M X="2.3500009" Y="7.9699993" Kh="2.0" Kw="1.06"><Scalar>f</Scalar>dg<Limits><M>bnbvnbvnbvn</M><M>d</M><M>bvnbvn</M></Limits><Vector>f</Vector>g</M></Free></M><M X="10.8" Y="8.34" Kh="7.08" Kw="0.5">}</M></LogBr></Formula>ссылки на документы, созданные  и открываемые в других </P>
<P /></Modul>
