<?xml version="1.0" encoding="windows-1251"?>

<Modul UId="TWJ6TB9X65AKDNGH62BE" Author="Волосатова Т.М., Родионов С.В." Level="0" ADate="F1RZ22LX">
<Title>Рекомендации по выбор метода сортировки</Title>
<P>Каждый программист должен располагать широким набором алгоритмов сортировки. Несмотря на то, что в среднем случае оптимальной является именно <Term Type="In">быстрая сортировка</Term>, она не является лучшей во всех случаях. Например, при сортировке очень маленьких списков (например, менее 100 элементов) дополнительный объем работы, создаваемый рекурсивными вызовами быстрой сортировки, может перекрыть преимущества ее более хорошего алгоритма. В таких редких случаях один их простых методов сортировки &#x2014; возможно, даже пузырьковая сортировка &#x2014; может работать быстрее. Кроме того, если известно, что список уже почти упорядочен или если нет желания переставлять одинаковые ключи, какой-либо другой алгоритм подойдет лучше, чем быстрая сортировка. Суть сказанного заключается в том, что лишь тот факт, что быстрая сортировка является лучшим алгоритмом общего назначения, не означает, что в конкретных случаях другие подходы не дадут лучших результатов.</P>
</Modul>
